# Questions - 01

In [1]:
# Calling libraries 

import pandas as pd

# Creating an dataframe for  DATA01 & DATA02 as shown above:-

DATA01 = pd.DataFrame({'EMP_ID': ['2101', '2102', '2103', '2104'],
                     'SALARY_YEAR1': ['1000', '2000', '3000', '4000'],
                     'SALARY_YEAR2': ['2000', '4000', '6000', '8000']})
   
DATA02 = pd.DataFrame({'EMP_ID': ['2101', '2106', '2103', '2104'],
                          'SALARY_YEAR3': ['3000', '6000', '12000', '16000'],
                          'SALARY_YEAR4': ['4000', '8000', '15000', '30000']})
                          
# Write a code Merge the two dataframes and name or assign it to 'DATA'.

DATA = pd.merge(DATA01,DATA02,how='outer',on='EMP_ID')

# Write a code to print the dataframe.

print(DATA)

  EMP_ID SALARY_YEAR1 SALARY_YEAR2 SALARY_YEAR3 SALARY_YEAR4
0   2101         1000         2000         3000         4000
1   2102         2000         4000          NaN          NaN
2   2103         3000         6000        12000        15000
3   2104         4000         8000        16000        30000
4   2106          NaN          NaN         6000         8000

# Question - 02

In [2]:
# Calling libraries 

import pandas as pd

# Creating an dataframe for  DATA01 & DATA02 as shown above:-

DATA01 = pd.DataFrame({'SALARY_YEAR1': ['1000', '2000', '3000', '4000'],
                     'SALARY_YEAR2': ['2000', '4000', '6000', '8000']},
                    index= ['2101', '2102', '2103', '2104'])
   
DATA02 = pd.DataFrame({'SALARY_YEAR3': ['3000', '6000', '12000', '16000'],
                          'SALARY_YEAR4': ['4000', '8000', '15000', '30000']},
                      index= ['2101', '2106', '2103', '2104'])
                      
# Write a code to inner join the the two dataframes and assign/name it as DATA.

DATA = DATA01.join(DATA02,how ='inner')


# Write a code to print the dataframe.

print(DATA)

     SALARY_YEAR1 SALARY_YEAR2 SALARY_YEAR3 SALARY_YEAR4
2101         1000         2000         3000         4000
2103         3000         6000        12000        15000
2104         4000         8000        16000        30000

# Question - 03

In [3]:
# Calling libraries

import pandas as pd

# Creating an dataframe for  DATA01 as shown above:-

DATA01 = pd.DataFrame({'Name':['Karthika', 'Abhishek', 'Edwin', 'Alex', 'Deepika','Vinay','Vimal','Archit','Harsha','Varsha','Deepthi','Alekhya'],
                     'sex':['F', 'M', 'M', 'M', 'F','M','M','M','M','F','F','F'],'age':[21,25,29,26,23,26,24,28,27,22,22,23],
                     'coach_no':['A01','A03','A03','A05','A01','A05','A03','A05','A06','A01','A02','A02'],
                     'Class':[2,2,2,1,2,1,2,1,1,2,3,3],
                     'Ticket_no':[111,112,113,114,115,116,117,118,119,120,121,122],
                     'Fare':[1000,1000,1000,2000,1000,2000,1000,2000,2000,1000,500,500]})

# Write a code to Rename the column from sex to Gender and assign it to the new dataframe named as DATA02.

DATA02=DATA01.rename(columns= {'sex':'Gender'})

# Write a code to print the dataframe.

print(DATA02)

        Name Gender  age coach_no  Class  Ticket_no  Fare
0   Karthika      F   21      A01      2        111  1000
1   Abhishek      M   25      A03      2        112  1000
2      Edwin      M   29      A03      2        113  1000
3       Alex      M   26      A05      1        114  2000
4    Deepika      F   23      A01      2        115  1000
5      Vinay      M   26      A05      1        116  2000
6      Vimal      M   24      A03      2        117  1000
7     Archit      M   28      A05      1        118  2000
8     Harsha      M   27      A06      1        119  2000
9     Varsha      F   22      A01      2        120  1000
10   Deepthi      F   22      A02      3        121   500
11   Alekhya      F   23      A02      3        122   500

# Question - 04

In [4]:
# Calling libraries

import pandas as pd

# Creating an dataframe for  DATA01 as shown above:-

DATA01 = pd.DataFrame({'Name':['Karthika', 'Abhishek', 'Edwin', 'Alex', 'Deepika','Vinay','Vimal','Archit','Harsha','Varsha','Deepthi','Alekhya'],
                     'sex':['F', 'M', 'M', 'M', 'F','M','M','M','M','F','F','F'],'age':[21,25,29,26,23,26,24,28,27,22,22,23],
                     'coach_no':['A01','A03','A03','A05','A01','A05','A03','A05','A06','A01','A02','A02'],
                     'Class':[2,2,2,1,2,1,2,1,1,2,3,3],
                     'Ticket_no':[111,112,113,114,115,116,117,118,119,120,121,122],
                     'Fare':[1000,1000,1000,2000,1000,2000,1000,2000,2000,1000,500,500]})

# Write a code to Drop the column from Ticket_no and assign it to the new dataframe named as DATA02.

DATA02=DATA01.drop('Ticket_no',axis=1) 

# Write a code to print the dataframe.

print(DATA02)

        Name sex  age coach_no  Class  Fare
0   Karthika   F   21      A01      2  1000
1   Abhishek   M   25      A03      2  1000
2      Edwin   M   29      A03      2  1000
3       Alex   M   26      A05      1  2000
4    Deepika   F   23      A01      2  1000
5      Vinay   M   26      A05      1  2000
6      Vimal   M   24      A03      2  1000
7     Archit   M   28      A05      1  2000
8     Harsha   M   27      A06      1  2000
9     Varsha   F   22      A01      2  1000
10   Deepthi   F   22      A02      3   500
11   Alekhya   F   23      A02      3   500

# Question - 05

In [5]:
# Calling libraries

import pandas as pd

# Creating an dataframe for  DATA01 as shown above:-

DATA01 = pd.DataFrame({'Name':['Kartika', 'Abhishek', 'Edwin', 'Alex', 'Deepika','Vinay','Vimal','Archit','Harsha','Varsha','Deepthi','Alekhya'],
                     'sex':['F', 'M', 'M', 'M', 'F','M','M','M','M','F','F','F'],'age':[21,25,29,26,23,26,24,28,27,22,22,23],
                     'coach_no':['A01','A03','A03','A05','A01','A05','A03','A05','A06','A01','A02','A02'],
                     'Class':[2,2,2,1,2,1,2,1,1,2,3,3],
                     'Ticket_no':[111,112,113,114,115,116,117,118,119,120,121,122],
                     'Fare':[1000,1000,1000,2000,1000,2000,1000,2000,2000,1000,500,500]})

#Write a code to Drop the first five rows from DATA01 and assign it to the new dataframe named as DATA02.

DATA02=DATA01.drop(DATA01.index[0:5])

# Write a code to print the dataframe.

print(DATA02)

       Name sex  age coach_no  Class  Ticket_no  Fare
5     Vinay   M   26      A05      1        116  2000
6     Vimal   M   24      A03      2        117  1000
7    Archit   M   28      A05      1        118  2000
8    Harsha   M   27      A06      1        119  2000
9    Varsha   F   22      A01      2        120  1000
10  Deepthi   F   22      A02      3        121   500
11  Alekhya   F   23      A02      3        122   500

# Question - 06

In [6]:
# Calling libraries

import pandas as pd

# Creating an dataframe for  DATA01 as shown above:-

DATA01 = pd.DataFrame({'Name':['Kartika', 'Abhishek', 'Edwin', 'Alex', 'Deepika','Vinay','Vimal','Archit','Harsha','Varsha','Deepthi','Alekhya'],
                     'sex':['F', 'M', 'M', 'M', 'F','M','M','M','M','F','F','F'],'age':[21,25,29,26,23,26,24,28,27,22,22,23],
                     'coach_no':['A01','A03','A03','A05','A01','A05','A03','A05','A06','A01','A02','A02'],
                     'Class':[2,2,2,1,2,1,2,1,1,2,3,3],
                     'Ticket_no':[111,112,113,114,115,116,117,118,119,120,121,122],
                     'Fare':[1000,1000,1000,2000,1000,2000,1000,2000,2000,1000,500,500]})

# Write a code to Drop the third column age from DATA01 and assign it to the new dataframe named as DATA02.

DATA02=DATA01.drop(DATA01.columns[2],axis=1)

# Write a code to print the dataframe.

print(DATA02)

        Name sex coach_no  Class  Ticket_no  Fare
0    Kartika   F      A01      2        111  1000
1   Abhishek   M      A03      2        112  1000
2      Edwin   M      A03      2        113  1000
3       Alex   M      A05      1        114  2000
4    Deepika   F      A01      2        115  1000
5      Vinay   M      A05      1        116  2000
6      Vimal   M      A03      2        117  1000
7     Archit   M      A05      1        118  2000
8     Harsha   M      A06      1        119  2000
9     Varsha   F      A01      2        120  1000
10   Deepthi   F      A02      3        121   500
11   Alekhya   F      A02      3        122   500

# Question  - 07

In [7]:
# Calling libraries

import pandas as pd

# Creating an dataframe for  DATA01 as shown above:-

DATA01 = pd.DataFrame({'Name':['Kartika', 'Abhishek', 'Edwin', 'Alex', 'Deepika','Vinay','Vimal','Archit','Harsha','Varsha','Deepthi','Alekhya'],
                     'sex':['F', 'M', 'M', 'M', 'F','M','M','M','M','F','F','F'],'age':[21,25,29,26,23,26,24,28,27,22,22,23],
                     'coach_no':['A01','A03','A03','A05','A01','A05','A03','A05','A06','A01','A02','A02'],
                     'Class':[2,2,2,1,2,1,2,1,1,2,3,3],
                     'Ticket_no':[111,112,113,114,115,116,117,118,119,120,121,122],
                     'Fare':[1000,1000,1000,2000,1000,2000,1000,2000,2000,1000,500,500]})

# Write a code to identify duplicates in coach_no .

DATA02 = DATA01.duplicated(['coach_no'])

# Write a code to print the count of duplicates in boolean format.

print(DATA02.value_counts())

True     7
False    5
dtype: int64

# Question - 08

In [8]:
# Calling libraries

import pandas as pd

# Creating an dataframe for  DATA01 as shown above:-

DATA01 = pd.DataFrame({'Name':['Kartika', 'Abhishek', 'Edwin', 'Alex', 'Deepika','Vinay','Vimal','Archit','Harsha','Varsha','Deepthi','Alekhya'],
                     'sex':['F', 'M', 'M', 'M', 'F','M','M','M','M','F','F','F'],'age':[21,25,29,26,23,26,24,28,27,22,22,23],
                     'coach_no':['A01','A03','A03','A05','A01','A05','A03','A05','A06','A01','A02','A02'],
                     'Class':[2,2,2,1,2,1,2,1,1,2,3,3],
                     'Ticket_no':[111,112,113,114,115,116,117,118,119,120,121,122],
                     'Fare':[1000,1000,1000,2000,1000,2000,1000,2000,2000,1000,500,500]})


# Write a code to create an dictionary keys as 3 ,2 and 1 values : semi-sleeper for 3 ,sleeper for 2 , AC-sleeper  for 1 name the dictionary as classes.

classes={3 : 'semi-sleeper',2 : 'sleeper' , 1 : 'AC-sleeper'}

# Write a code to create a column as classes and map the semi-sleeper ,sleeper and  AC-sleeper in that respective class for the given dataset.

DATA01['classes']=DATA01['Class'].map(classes)

# Write a code to print the dataframe.

print(DATA01)

        Name sex  age coach_no  Class  Ticket_no  Fare       classes
0    Kartika   F   21      A01      2        111  1000       sleeper
1   Abhishek   M   25      A03      2        112  1000       sleeper
2      Edwin   M   29      A03      2        113  1000       sleeper
3       Alex   M   26      A05      1        114  2000    AC-sleeper
4    Deepika   F   23      A01      2        115  1000       sleeper
5      Vinay   M   26      A05      1        116  2000    AC-sleeper
6      Vimal   M   24      A03      2        117  1000       sleeper
7     Archit   M   28      A05      1        118  2000    AC-sleeper
8     Harsha   M   27      A06      1        119  2000    AC-sleeper
9     Varsha   F   22      A01      2        120  1000       sleeper
10   Deepthi   F   22      A02      3        121   500  semi-sleeper
11   Alekhya   F   23      A02      3        122   500  semi-sleeper

# Question - 09

In [9]:
# Calling libraries

import pandas as pd

# Creating an dataframe for  DATA01 as shown above:-

DATA01 = pd.DataFrame({'Name':['Kartika', 'Abhishek', 'Edwin', 'Alex', 'Deepika','Vinay','Vimal','Archit','Harsha','Varsha','Deepthi','Alekhya'],
                     'sex':['F', 'M', 'M', 'M', 'F','M','M','M','M','F','F','F'],'age':[21,25,29,26,23,26,24,28,27,22,22,23],
                     'coach_no':['A01','A03','A03','A05','A01','A05','A03','A05','A06','A01','A02','A02'],
                     'Class':[2,2,2,1,2,1,2,1,1,2,3,3],
                     'Ticket_no':[111,112,113,114,115,116,117,118,119,120,121,122],
                     'Fare':[1000,1000,1000,2000,1000,2000,1000,2000,2000,1000,500,500]})


#  Write a code to print the average fare for all individual classes. [Hint :- use group by]

print(DATA01.groupby('Class').mean()['Fare'])

Class
1    2000.0
2    1000.0
3     500.0
Name: Fare, dtype: float64

# Question - 10

In [10]:
# Calling libraries

import pandas as pd

# Creating an dataframe for  DATA01 as shown above:-

DATA01 = pd.DataFrame({'Name':['Kartika', 'Abhishek', 'Edwin', 'Alex', 'Deepika','Vinay','Vimal','Archit','Harsha','Varsha','Deepthi','Alekhya'],
                     'sex':['F', 'M', 'M', 'M', 'F','M','M','M','M','F','F','F'],'age':[21,25,29,26,23,26,24,28,27,22,22,23],
                     'coach_no':['A01','A03','A03','A05','A01','A05','A03','A05','A06','A01','A02','A02'],
                     'Class':[2,2,2,1,2,1,2,1,1,2,3,3],
                     'Ticket_no':[111,112,113,114,115,116,117,118,119,120,121,122],
                     'Fare':[1000,1000,1000,2000,1000,2000,1000,2000,2000,1000,500,500]})


# Write a code to print the average age of all genders as per there respective passenger class from the given dataset.[use - pivot_table]


print(DATA01.pivot_table(index='sex',columns = 'Class',values='age', aggfunc='mean'))

Class      1     2     3
sex
F        NaN  22.0  22.5
M      26.75  26.0   NaN